bytedance_sz.org
'#+include: back.org
#+TITLE: 字节跳动暑期实习后端开发工程师-内容安全(已offer)


* DONE 技术中台

CLOSED: <2022-03-16 Wed> ~ 1hour

原本以为铁挂，感谢面试官。

** 总体感受
后端开发，多背八股。之前准备客户端比较多，没复习数据库，哎。

** 算法题（先陈述思路，然后写代码，限时30min）
1. 给你一个循环右移N（未知）位后的严格单调数组，找该数组中位数。
   先二分找到最大值下标mid；len为奇数，中位数下标=(mid+len/2+1)%len
   len为偶数，中位数下标是(mid+len/2)%len和(mid+len/2+1)%len

** 基础知识
*** C++
1. new/delete和malloc/free的区别
2. 什么时候用delete，什么时候用delete[]
3. 用错了有什么后果？
4. 四种智能指针
5. shared\under{}ptr是线程安全的吗？
6. 你怎么实现线程安全的shared\under{}ptr？
7. 四种cast
8. 常用stl容器
9. vector向push\under{}back元素时可能会发生什么
10. map和set的底层
11. 红黑树是什么
12. set中，红黑树的每个节点都存了什么，只有key吗？

*** 计网
1. TCP和UDP的区别
2. TCP为什么可靠
3. TCP报头为什么要有序列号
4. 讲讲TCP的拥塞控制
5. 发送窗口怎么决定
6. 讲讲浏览器访问网址时，DNS的整个过程。
7. 你知道全世界有几台根域名服务器吗（不知道也没关系）
8. 那么，每次LDNS服务器都会去向根域名服务器查询吗？
9. 既然你说不会，那它是怎么做的？
10. DNS查询后得到的ip地址一定是正确的吗？(DNS劫持)，有什么攻击手段？
11. 你知道访问同一个ip地址，可以转发到不同域名的服务器上的技术是什么吗？
12. HTTPS的证书为什么可信（注意是可信）？
13. 服务器编一个证书，你怎么知道这个证书是可信的？


*** 操作系统
1. 进程和线程区别
2. 乐观锁和悲观锁
3. IO多路复用
4. 它们的区别

*** 数据库（我说我没复习）
1. 哪些场景下索引会失效


** 反问
1. 面试表现。面试官说其它回答的还可以，但是数据库在很多岗位都要使用，最好比较熟悉，但是实习主要看中潜力，所以我们还需要复核，你还是有可能通过的。
2. 如果有幸拿到offer，进去之后主要做什么？
3. 暑期实习项目是否有期限？


* 内容安全

听HR说是中台挂了然后转到偏业务一点的部门继续加面。

** DONE 一面

CLOSED: <2022-03-25 Fri>

*** 基础知识
基础知识基本问的八股，也没挖很深。
*** 算法题
1. 正整数数组，如何排序，通过字符串拼接可以得到最大数字？
   思路
#+begin_src cpp
  to_string(a[i])+to_string(a[j])>to_string(a[j])+to_string(a[i])
#+end_src

2. LC122买卖股票最佳时机II

** DONE 二面

CLOSED: <2022-03-31 Thu>

*** 基础知识
面试官说上一面其它问的比较全，所以只问了操作系统
1. 一个进程访问物理内存的过程
2. 为什么不直接用物理内存
3. 以fork()为例，说说内存会发生什么变化
4. COW会复制所有内存空间吗？
5. 内存满了会发生什么呢

*** 算法题
1. 二维数组，行从左到右递增，每行的第一个元素大于上一行最后一个元素，判断target是否存在。
   思路很简单的，但是边界条件容易出错，面试官着重看了边界条件的处理，并且让你自己写testcase尽量全的覆盖到所有情况，并且反问你觉得你的testcase能否保证你代码的可靠性。

*** 反问
面试官一会要开会我就没问了问表现如何。
二面结束后两小时收到了三面邀请。

** DONE 三面

- ORIGINAL: <2022-04-02 Sat>
  :REMARK: 临时取消
+ MODIFIED: <2022-04-07 Thu>

*** 基础知识
1. 浏览器访问URL流程
2. CA证书是如何发挥作用的
3. 数据库的事务、索引。
4. B树和B+树的区别
*** 算法题
1. 给定char二维数组m和string w，可以从m的任意位置出发上下左右移动，返回是否能匹配w。 可以重复访问m中已访问过的位置。
*** 项目
1. 自己说一下项目
2. joblib的三个功能
3. 为什么要序列化
4. 为什么要用协程
5. majsoul_ws的难点（数据传输用到protobuf）
6. 你说一下protobuf的类型有哪些



** DONE HR面
三面后七八分钟的样子收到HR面通知，立即开始。

大概聊了在校情况、技术方面的学习习惯、工作后的如何学习和快速适应、出勤时间。
然后内容安全这个部门HR说是新开的，HC比较充足，不会因为HC不够挂人。
HR说如果挂了48小时内会收到拒信，如果通过的话大概3-5天offer审批就会下来。

** DONE OFFER

CLOSED: <2022-04-08 Fri>

HR面第二天下午接到电话约了入职办理时间，并发了正式录用邮件，流程好快。
