bytedance_sz.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-10 Tue 21:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>字节跳动暑期实习后端开发工程师-内容安全(已offer)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="于承业" />
</head>
<body>
<div id="content">
<h1 class="title">字节跳动暑期实习后端开发工程师-内容安全(已offer)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org052a0a5">1. <span class="done DONE">DONE</span> 技术中台</a>
<ul>
<li><a href="#orgfe10f26">1.1. 总体感受</a></li>
<li><a href="#orgdc9d0c3">1.2. 算法题（先陈述思路，然后写代码，限时30min）</a></li>
<li><a href="#org5168be3">1.3. 基础知识</a>
<ul>
<li><a href="#orgdef3f7b">1.3.1. C++</a></li>
<li><a href="#org0581609">1.3.2. 计网</a></li>
<li><a href="#orga493a5a">1.3.3. 操作系统</a></li>
<li><a href="#org69aaf13">1.3.4. 数据库（我说我没复习）</a></li>
</ul>
</li>
<li><a href="#orgd83eefb">1.4. 反问</a></li>
</ul>
</li>
<li><a href="#org51e8d81">2. 内容安全</a>
<ul>
<li><a href="#org8e4af1f">2.1. <span class="done DONE">DONE</span> 一面</a>
<ul>
<li><a href="#org2b812cc">2.1.1. 基础知识</a></li>
<li><a href="#orgebf4c37">2.1.2. 算法题</a></li>
</ul>
</li>
<li><a href="#org182f0db">2.2. <span class="done DONE">DONE</span> 二面</a>
<ul>
<li><a href="#orgf665840">2.2.1. 基础知识</a></li>
<li><a href="#org3a71238">2.2.2. 算法题</a></li>
<li><a href="#orge99a1cc">2.2.3. 反问</a></li>
</ul>
</li>
<li><a href="#org4206c16">2.3. <span class="done DONE">DONE</span> 三面</a>
<ul>
<li><a href="#org424ccf2">2.3.1. 基础知识</a></li>
<li><a href="#org1b9752e">2.3.2. 算法题</a></li>
<li><a href="#org554ab53">2.3.3. 项目</a></li>
</ul>
</li>
<li><a href="#orgc7e8f21">2.4. <span class="done DONE">DONE</span> HR面</a></li>
<li><a href="#orge3798c1">2.5. <span class="done DONE">DONE</span> OFFER</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
'#+include: back.org
</p>


<div id="outline-container-org052a0a5" class="outline-2">
<h2 id="org052a0a5"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> 技术中台</h2>
<div class="outline-text-2" id="text-1">
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-16 Wed&gt; </span></span> ~ 1hour
</p>

<p>
原本以为铁挂，感谢面试官。
</p>
</div>

<div id="outline-container-orgfe10f26" class="outline-3">
<h3 id="orgfe10f26"><span class="section-number-3">1.1</span> 总体感受</h3>
<div class="outline-text-3" id="text-1-1">
<p>
后端开发，多背八股。之前准备客户端比较多，没复习数据库，哎。
</p>
</div>
</div>

<div id="outline-container-orgdc9d0c3" class="outline-3">
<h3 id="orgdc9d0c3"><span class="section-number-3">1.2</span> 算法题（先陈述思路，然后写代码，限时30min）</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>给你一个循环右移N（未知）位后的严格单调数组，找该数组中位数。
先二分找到最大值下标mid；len为奇数，中位数下标=(mid+len/2+1)%len
len为偶数，中位数下标是(mid+len/2)%len和(mid+len/2+1)%len</li>
</ol>
</div>
</div>

<div id="outline-container-org5168be3" class="outline-3">
<h3 id="org5168be3"><span class="section-number-3">1.3</span> 基础知识</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgdef3f7b" class="outline-4">
<h4 id="orgdef3f7b"><span class="section-number-4">1.3.1</span> C++</h4>
<div class="outline-text-4" id="text-1-3-1">
<ol class="org-ol">
<li>new/delete和malloc/free的区别</li>
<li>什么时候用delete，什么时候用delete[]</li>
<li>用错了有什么后果？</li>
<li>四种智能指针</li>
<li>shared_ptr是线程安全的吗？</li>
<li>你怎么实现线程安全的shared_ptr？</li>
<li>四种cast</li>
<li>常用stl容器</li>
<li>vector向push_back元素时可能会发生什么</li>
<li>map和set的底层</li>
<li>红黑树是什么</li>
<li>set中，红黑树的每个节点都存了什么，只有key吗？</li>
</ol>
</div>
</div>

<div id="outline-container-org0581609" class="outline-4">
<h4 id="org0581609"><span class="section-number-4">1.3.2</span> 计网</h4>
<div class="outline-text-4" id="text-1-3-2">
<ol class="org-ol">
<li>TCP和UDP的区别</li>
<li>TCP为什么可靠</li>
<li>TCP报头为什么要有序列号</li>
<li>讲讲TCP的拥塞控制</li>
<li>发送窗口怎么决定</li>
<li>讲讲浏览器访问网址时，DNS的整个过程。</li>
<li>你知道全世界有几台根域名服务器吗（不知道也没关系）</li>
<li>那么，每次LDNS服务器都会去向根域名服务器查询吗？</li>
<li>既然你说不会，那它是怎么做的？</li>
<li>DNS查询后得到的ip地址一定是正确的吗？(DNS劫持)，有什么攻击手段？</li>
<li>你知道访问同一个ip地址，可以转发到不同域名的服务器上的技术是什么吗？</li>
<li>HTTPS的证书为什么可信（注意是可信）？</li>
<li>服务器编一个证书，你怎么知道这个证书是可信的？</li>
</ol>
</div>
</div>


<div id="outline-container-orga493a5a" class="outline-4">
<h4 id="orga493a5a"><span class="section-number-4">1.3.3</span> 操作系统</h4>
<div class="outline-text-4" id="text-1-3-3">
<ol class="org-ol">
<li>进程和线程区别</li>
<li>乐观锁和悲观锁</li>
<li>IO多路复用</li>
<li>它们的区别</li>
</ol>
</div>
</div>

<div id="outline-container-org69aaf13" class="outline-4">
<h4 id="org69aaf13"><span class="section-number-4">1.3.4</span> 数据库（我说我没复习）</h4>
<div class="outline-text-4" id="text-1-3-4">
<ol class="org-ol">
<li>哪些场景下索引会失效</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgd83eefb" class="outline-3">
<h3 id="orgd83eefb"><span class="section-number-3">1.4</span> 反问</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>面试表现。面试官说其它回答的还可以，但是数据库在很多岗位都要使用，最好比较熟悉，但是实习主要看中潜力，所以我们还需要复核，你还是有可能通过的。</li>
<li>如果有幸拿到offer，进去之后主要做什么？</li>
<li>暑期实习项目是否有期限？</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org51e8d81" class="outline-2">
<h2 id="org51e8d81"><span class="section-number-2">2</span> 内容安全</h2>
<div class="outline-text-2" id="text-2">
<p>
听HR说是中台挂了然后转到偏业务一点的部门继续加面。
</p>
</div>

<div id="outline-container-org8e4af1f" class="outline-3">
<h3 id="org8e4af1f"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> 一面</h3>
<div class="outline-text-3" id="text-2-1">
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-25 Fri&gt;</span></span>
</p>
</div>

<div id="outline-container-org2b812cc" class="outline-4">
<h4 id="org2b812cc"><span class="section-number-4">2.1.1</span> 基础知识</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
基础知识基本问的八股，也没挖很深。
</p>
</div>
</div>
<div id="outline-container-orgebf4c37" class="outline-4">
<h4 id="orgebf4c37"><span class="section-number-4">2.1.2</span> 算法题</h4>
<div class="outline-text-4" id="text-2-1-2">
<ol class="org-ol">
<li>正整数数组，如何排序，通过字符串拼接可以得到最大数字？
思路</li>
</ol>
<div class="org-src-container">
<pre class="src src-cpp">to_string(<span style="color: #228b22;">a</span>[i])+to_string(a[j])&gt;to_string(a[j])+to_string(a[i])
</pre>
</div>

<ol class="org-ol">
<li>LC122买卖股票最佳时机II</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org182f0db" class="outline-3">
<h3 id="org182f0db"><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> 二面</h3>
<div class="outline-text-3" id="text-2-2">
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-31 Thu&gt;</span></span>
</p>
</div>

<div id="outline-container-orgf665840" class="outline-4">
<h4 id="orgf665840"><span class="section-number-4">2.2.1</span> 基础知识</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
面试官说上一面其它问的比较全，所以只问了操作系统
</p>
<ol class="org-ol">
<li>一个进程访问物理内存的过程</li>
<li>为什么不直接用物理内存</li>
<li>以fork()为例，说说内存会发生什么变化</li>
<li>COW会复制所有内存空间吗？</li>
<li>内存满了会发生什么呢</li>
</ol>
</div>
</div>

<div id="outline-container-org3a71238" class="outline-4">
<h4 id="org3a71238"><span class="section-number-4">2.2.2</span> 算法题</h4>
<div class="outline-text-4" id="text-2-2-2">
<ol class="org-ol">
<li>二维数组，行从左到右递增，每行的第一个元素大于上一行最后一个元素，判断target是否存在。
思路很简单的，但是边界条件容易出错，面试官着重看了边界条件的处理，并且让你自己写testcase尽量全的覆盖到所有情况，并且反问你觉得你的testcase能否保证你代码的可靠性。</li>
</ol>
</div>
</div>

<div id="outline-container-orge99a1cc" class="outline-4">
<h4 id="orge99a1cc"><span class="section-number-4">2.2.3</span> 反问</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
面试官一会要开会我就没问了问表现如何。
二面结束后两小时收到了三面邀请。
</p>
</div>
</div>
</div>

<div id="outline-container-org4206c16" class="outline-3">
<h3 id="org4206c16"><span class="section-number-3">2.3</span> <span class="done DONE">DONE</span> 三面</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>ORIGINAL: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-04-02 Sat&gt;</span></span>
:REMARK: 临时取消</li>
<li>MODIFIED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-04-07 Thu&gt;</span></span></li>
</ul>
</div>

<div id="outline-container-org424ccf2" class="outline-4">
<h4 id="org424ccf2"><span class="section-number-4">2.3.1</span> 基础知识</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li>浏览器访问URL流程</li>
<li>CA证书是如何发挥作用的</li>
<li>数据库的事务、索引。</li>
<li>B树和B+树的区别</li>
</ol>
</div>
</div>
<div id="outline-container-org1b9752e" class="outline-4">
<h4 id="org1b9752e"><span class="section-number-4">2.3.2</span> 算法题</h4>
<div class="outline-text-4" id="text-2-3-2">
<ol class="org-ol">
<li>给定char二维数组m和string w，可以从m的任意位置出发上下左右移动，返回是否能匹配w。 可以重复访问m中已访问过的位置。</li>
</ol>
</div>
</div>
<div id="outline-container-org554ab53" class="outline-4">
<h4 id="org554ab53"><span class="section-number-4">2.3.3</span> 项目</h4>
<div class="outline-text-4" id="text-2-3-3">
<ol class="org-ol">
<li>自己说一下项目</li>
<li>joblib的三个功能</li>
<li>为什么要序列化</li>
<li>为什么要用协程</li>
<li>majsoul<sub>ws的难点</sub>（数据传输用到protobuf）</li>
<li>你说一下protobuf的类型有哪些</li>
</ol>
</div>
</div>
</div>



<div id="outline-container-orgc7e8f21" class="outline-3">
<h3 id="orgc7e8f21"><span class="section-number-3">2.4</span> <span class="done DONE">DONE</span> HR面</h3>
<div class="outline-text-3" id="text-2-4">
<p>
三面后七八分钟的样子收到HR面通知，立即开始。
</p>

<p>
大概聊了在校情况、技术方面的学习习惯、工作后的如何学习和快速适应、出勤时间。
然后内容安全这个部门HR说是新开的，HC比较充足，不会因为HC不够挂人。
HR说如果挂了48小时内会收到拒信，如果通过的话大概3-5天offer审批就会下来。
</p>
</div>
</div>

<div id="outline-container-orge3798c1" class="outline-3">
<h3 id="orge3798c1"><span class="section-number-3">2.5</span> <span class="done DONE">DONE</span> OFFER</h3>
<div class="outline-text-3" id="text-2-5">
<p>
CLOSED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-04-08 Fri&gt;</span></span>
</p>

<p>
HR面第二天下午接到电话约了入职办理时间，并发了正式录用邮件，流程好快。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 于承业</p>
<p class="date">Created: 2022-05-10 Tue 21:29</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
